# LevelId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Element..::..LevelId Property
Element Class See Also
---
The id of the level associated with the element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ElementId LevelId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property LevelId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ LevelId {
	ElementId^ get ();
}
```

# See Also
Element Class
Autodesk.Revit.DB Namespace